import styles from "./AboutPage.module.css";

const AboutPage = () => {
  return (
    <div className={styles.container}>
      <h2 className={styles.title}>О проекте</h2>
      <p className={styles.text}>
        🚀 Добро пожаловать в мир быстрых слов! Этот проект — динамичная игра,
        где побеждает скорость, внимание и реакция.
      </p>
      <p className={styles.text}>
        ⏱ Вводи слова до того, как истечёт время, собирай очки и докажи,
        что твой мозг работает быстрее всех.
      </p>
      <p className={styles.text}>
        🏆 Цель проста: набрать максимум очков и попасть в топ игроков.
      </p>
      <p className={styles.text}>
        🎮 Мини-игра на React, где можно угадывать слова, видеть свой лучший результат и топ игроков. Сделано для практики и тренировки навыков веб-разработки
      </p>
    </div>
  );
};

export default AboutPage;